# -*- coding: utf-8 -*-
"""
Created on Wed Feb 19 14:56:22 2025

@author: Илья
"""
import numpy as np
import matplotlib.pyplot as plt



freqs =np.array( [5,10,15,20,25,30,35,40,45,50,55,60,65,70,75,80,85,90,95,100,105,110,115,120])*10 # частота генерации сигнала
K = np.array([2,1.7,1.529,1.426,1.312,1.305,1.355,1.4,1.46,1.451,1.26,1.1,0.936,0.803,0.731,0.64,0.571,0.523,0.468,0.432,0.388,0.192,0.173,0.153]) # отношение амплитуды сигнала на осциллографе к амплитуде сигнала генератора

plt.plot(freqs,K)

np.savetxt('file.txt',np.column_stack((freqs, K)),delimiter='\t')